app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @items = Item.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @items = Item.find(params[:id])

INSERT INTO "items" ("item", "created_at", "updated_at") VALUES (?, ?, ?)  [["item", "Clean"], ["created_at", "2021-02-22 14:48:13.121357"], ["updated_at", "2021-02-22 14:48:13.121357"]]
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "item" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["item", "Walk Dogs"], ["updated_at", "2021-02-22 17:19:17.387589"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def destroy
    @item.destroy

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_item
      @item = Item.find(params[:id])